[
"The shape of ancient Egyptian pyramids is thought to have been inspired by the spreading rays of the sun.",
"An Egyptian father named his newborn daughter “Facebook” to commemorate the role Facebook played in the 2011 Egyptian revolution. Her full name is Facebook Jamal Ibrahim.g",
"Egypt has the largest Arabic population in the world.",
"Pharaoh Pepi II (2246-2152 B.C.) had the longest reign in history—94 years. He became Egypt’s king when he was only 6 years old.",
"The literacy rate for Egyptian men is 83% and 59.4% for women, checkout out Enlighten Project.",
"On average, only an inch of rain falls in Egypt per year.",
"Egyptian history is generally considered to have begun in 3200 B.C. when King Menes (also called Narmer) united the Upper and Lower Kingdoms. The last native dynasty fell to the Persians in 341 B.C. and was replaced by Greeks, Romans, and Byzantines. Arabs introduced Islam and the Arabic language into Egypt in the seventh century.",
"As of July 2011, the population of Egypt was 82,079,663, making it the 15th most populated country in the world. Approximately 99% of the population lives on about 5.5% of the land.",
"Ramses II (1279-1212 B.C.) is often considered the greatest pharaoh (“great house”) of the Egyptian empire. He ruled Egypt for 60 years and was the only pharaoh to carry the title “the Great” after his name. He had over 90 children: approximately 56 boys and 44 girls. He had eight official wives and nearly 100 concubines. He also had red hair, which was associated with the god Seth.",
"Great Pyramid The temperature inside the Great Pyramid equals the average temperature of the Earth (68F)",
"The famous Great Pyramid at Giza was built as a burial place for King Khufu (2589-2566 B.C.) and took more than 20 years to build. It is built from over    two million blocks of limestone, each one weighing as much as two and a half elephants. It stands about 460 feet (149 m) high—taller than the Statue of Liberty. The base of the Great Pyramid takes up almost as much space as five football fields.",
"Ancient Egyptians believed that mummification ensured the deceased a safe passage to the afterlife. The mummification process had two stages: first the embalming of the body, then the wrapping and burial of the body. Organs were stored in canopic jars, each jar representing a god.",
"Ancient Egyptians mummified not only people but animals as well. Archeologists discovered a 15-foot- (4.5-m-) long mummified crocodile. The crocodile is known as the “devourer of human hearts” in the ancient Book of the Dead.",
"Fly swatters made from giraffe tails were a popular fashion item in ancient Egypt.",
"Ancient Egyptian women had more rights and privileges than most other women in the ancient world. For example, they could own property, carry out business deals, and initiate divorce. Women from wealthy families could become doctors or priestesses.",
"In Egypt, both men and women wore eye make-up called kohl, which was made from ground-up raw material mixed with oil. They believed it had magical healing powers that could restore poor eyesight and fight eye infections.",
"For ancient Egyptians, bread was the most important food and beer was their favorite drink. Models of brewers were even left in tombs to ensure that the deceased had plenty of beer in the next world.",
"The ancient Egyptians had three different calendars: an everyday farming calendar, an astronomical calendar, and a lunar calendar. The 365-day farming calendar was made up of three seasons of four months. The astronomical calendar was based on observations of the star Sirius, which reappeared each year at the start of the flood season. Finally, priests kept a lunar calendar that told them when to perform ceremonies for the moon god Khonsu.",
"Hieroglyphs were developed about 3,000 B.C. and may have started as early wall paintings. In contrast to English’s 26 letters, there are more than 700 different Egyptian hieroglyphs.",
"Egypt’s first pyramid was a step pyramid built by famed Egyptian architect Imhotep for the pharaoh Djoser in 2600 B.C.",
"The ancient Egyptians worshipped more than 1,000 different gods and goddesses. The most important god of all was Ra, the sun god.",
"Over its long history, Egypt has been known by many different names. For example, during the Old Kingdom (2650-2134 B.C.), Egypt was called Kemet or Black Land, which referred to the dark, rich soil of the Nile Valley. It was also called Deshret, or Red Land, which referred to Egypt’s vast deserts. Later, it was known as Hwt-ka-Ptah or “House of the Ka of Ptah.” Ptah was one of Egypt’s earliest gods. The Greeks changed Hwt-ka-ptah to Aegyptus.",
"Tourism compromises 12% of the work force in Egypt.",
"The Sahara Desert at one time was lush grassland and savannah. Overgrazing and/or climate change in 8000 B.C. began to change the area from pastoral land to desert. Now it is the world’s largest hot desert at over 3,630,000 square miles—roughly the size of the United States. Antarctica is considered the largest desert (of any type) in the world.",
"The first pharaoh of Egypt is considered to be King Menes, who united the Upper and Lower Kingdoms in 3150 B.C. He named the capital of the united lands Memphis, which means “Balance of Two Lands.” Legend says he ruled for 60 years until he was killed by a hippopotamus.",
"The fertility rate in Egypt is 2.97 children per woman, which is the 66th highest fertility rate in the world. Niger ranks first with 7.60 children per woman. The United States is 124th with 2.06 children per woman.",
"Egypt is the 30th largest country in the world by area. Slightly three times larger than New Mexico, Egypt’s area is 386,560 square miles (1,001,450 square km).",
"The 2011 Egyptian revolution began on January 25th. Egyptian protestors focused on lack of free speech and free elections, police brutality, government corruption, high unemployment, inflation, and continued use of emergency law. An estimated 800 people died and over 6,000 were injured in the process. Egyptian President Hosni Mubarak resigned on February 11th. The Egyptian revolution sparked other revolutions in Yemen, Syria, Jordan, Libya, and Bahrain.",
"To stay cool and avoid lice, both men and women in ancient Egypt shaved their heads and often wore wigs. In fact, because wigs indicated social status, they became one of the most important fashion accessories in ancient Egypt. Rich people wore wigs made from human hair, while poor people wore wigs made from wool or vegetable fiber.",
"The ancient Egyptians were the first people to have a year consisting of 365 days divided into 12 months. They also invented clocks.",
"The Egyptian polymath Imhotep (“the one who comes in peace”) is known as the first physician, the first engineer, and the first architect.",
"There are five million Facebook users in Egypt, more than any other Middle Eastern country. As of 2009, Egypt has 20.136 million Internet users, ranking 21st in the world.g",
"Nile River in Aswan The Nile is the world’s longest river and currently runs through nine countries",
"Egypt’s Nile River is the world’s longest, running 4,135 miles (6,670 km). Ancient Egyptians would measure the depth of the Nile using a “nilometer.” The English word “Nile” is derived from the Semitic nahal, meaning “river.” Ancient Egyptians called the river iteru, meaning “great river.”",
"In an attempt to control the annual flooding of the Nile, one of the largest dams in the world was built in Egypt in 1971: Aswan High Dam. Unfortunately, the rich silt that normally fertilized the dry Egyptian land settled in Lake Nasser after the building of the dam, forcing farmers to use one million tons of artificial fertilizer every year.",
"Ancient Egyptians believed the tears of the goddess Isis made the Nile overflow each year. They celebrated the flood with a festival called the “Night of the Tear Drop.”a",
"A priest often wore the jackal-headed mask of the god Anubis when making a body into a mummy. Ancient Egyptians associated Anubis (the god of the death) with jackals because jackals would uncover bodies from Egyptian cemeteries and eat them.",
"The Copts are the largest Christian community in Egypt and in the Middle East. Because Christianity was the main religion in Egypt between the fourth and sixth centuries, the term “Copt” originally meant all Egyptians.",
"The quality that ancient Egyptians valued most was called ma’at, which means good behavior, honesty, and justice. Ma’at is also the name of the goddess of truth who, according to myth, weighs every Egyptian heart after death.",
"Before an ancient Egyptian scribe wrote anything, he always poured out some water mixed with ink as an offering to the god Thoth, the messenger of the gods and patron of scribes and learning. Egyptians who could write were believed to have power from the gods.",
"The ancient Egyptians believed that the god Thoth invented writing and passed its secret to humans. His symbols were a bird called an ibis and a baboon.",
"Just 150 years ago, Americans and Europeans believed that mummies had great healing powers. They ground up the mummies into powder and used it as medicine for all kinds of diseases.",
"The word pharaoh began as a nickname for the Egyptian king. It means “great house” because everyone believed the king’s human body was home to a god. The term wasn’t actually used until the 20th dynasty (1185-1070 B.C.).",
"The Great Pyramid at Giza has vents pointing to the constellation of Orion so the mummy’s spirit could fly straight up to the gods.",
"Ancient Egyptians believed they were made from clay on a potter’s wheel by the river god Khnum.",
"In ancient Egypt, every big city supported one favorite god, similar to people who support football teams today.",
"Ancient Egyptians needed to predict when the Nile would flood, which led to the development of the world’s first calendar.",
"The pyramids of Egypt are not only the oldest of the seven wonders of the ancient world, they are the only ones to survive today. An Arab proverb captures the pyramids endurance: “Man fears Time, yet Time fears the pyramids.” The other six wonders are (1) the Hanging Gardens of Babylon, (2) the Temple of Artemis at Ephesus, (3) the Statue of Zeus at Olympia, (4) the Mausoleum of Halicarnassus, (5) the Colossus of Rhodes, and (6) the Lighthouse of Alexandria.",
"The oldest surviving work about mathematics was written by the ancient Egyptian scribe Ahmes around 1650 B.C. Found on the Rhine Mathematical Papyrus, it is titled “The Entrance into the Knowledge of All Existing Things and All Obscure Secrets.”h",
"The oldest death sentence recorded is found in ancient Egypt. Found in the Amherst papyri, a teenaged male in 1500 B.C. is sentenced to kill himself by either poison or stabbing for practicing magic.",
"Hieroglyphs were used only for ritual purposes and official inscriptions. For everyday use, Egyptians used a script called “hieratic.” In 700 B.C., a second script called “demotic” was used, of which a derivative is used by Coptic Christians today.",
"Ancient Egyptian tomb builders had their own guarded villages. They were well fed and looked after because their work was so important.",
"The oldest recorded standard of weight is the beqa, an ancient Egyptian unit equal to between 6.66 and 7.45 ounces. It is still used today.",
"In 2011, archeologists discovered an enormous statue of the ancient Egyptian pharaoh Amenhotep III (grandfather of Tutankhamen). One of the largest statues ever found, it was actually first discovered in 1923 and then rehidden.e",
"The ancient obelisk known as Cleopatra’s Needle has suffered more damage in the 125 years it has stood in New York City from pollution and weather than in the thousands of years it stood in Egypt.",
"The last known hieroglyphic inscription was made in A.D. 394 in the temple of Isis in Philae.",
"Sphinx No Nose The Sphinx is the largest monolith statue in the world",
"Although it is a popular notion that Napoleon’s troops shot off the nose of the Sphinx at Giza, sketches of the Sphinx from 1737 show it without a nose, more than 60 years before Napoleon reached Egypt. The only person known to have damaged it was an Islamic cleric, Sa’im al-dahr, who was hanged in 1378 for vandalism. He reportedly disapproved of “graven images”.",
"Scholars believe that ancient Egyptians were the first to sew wounds closed some 4,000 years ago. Egyptian doctors would often store their surgical needles in a case made from a hollowed-out bird bone.",
"Hippos were considered bad omens and were associated with the evil god Seth. They were more dangerous than crocodiles and they often capsized boats traveling the Nile.",
"The Berlin Papyrus (c. 1800 B.C.) contains directions for the oldest known pregnancy test. The test involved wetting cereals with urine. If barley grew, it meant the woman was pregnant with a male child; if the wheat grew, she was pregnant with a girl. If neither grew, the woman would not give birth.",
"To keep the hook shape of Ramses II’s nose from collapsing, embalmers stuffed his nostrils with peppercorns.",
"The scarab beetle was sacred to the Egyptians and represented life after death or resurrection.",
"Toilets were also included in some ancient Egyptian tombs.",
"“The Beautiful House” is the name of the house or tent where mummification took place in ancient Egypt.",
"British monarch, Charles the II (1630-1685) would rub mummy dust on his skin, believing “Greatness” would rub off.",
"Contrary to popular belief, Cleopatra was actually Greek, not Egyptian or African.",
"Near Tuna el-Gebel on the edge of Egypt’s Western Desert, scientists have unearthed more than four million mummies of a stork-like bird called an ibis.",
"Ramses II was publicly unwrapped in June 1886 in just 15 minutes. His body became contaminated by fungi and bacteria, which literally ate him little by little. In 1975, scientists used gamma rays to sterilize his body. He is now stored in an antibacterial case.",
"The embalmer who made the first cut in the flank during the mummification process was called “the ripper.” The Egyptians considered any cut an offense to the body—so in a symbolic performance, the rest of the embalmers threw stones at the ripper and chased him away with curses.",
"The Egyptians called the pyramids mer, a word whose etymology is debated. The English word “pyramid” comes from the Greek word pyramis, a type of wheat cake shaped like a pyramid.",
"If the Great Pyramid were chopped into 12-inch cubes, there would be enough cubes to circle the moon almost three times.",
"Early pharaohs were buried with their real servants. Later, model servants called shabti were used.",
"The first mummy is, according to legend, Osiris who was murdered by Seth. Isis wrapped him in bandages and he came back to life as the god of the dead, or the afterlife.",
"Mud was pushed under the mummy’s skin to pad it out. False eyes could be made from onions. Hooked tools pulled the brain (which was always removed, along with the kidneys, liver, lungs, and heart) through the nose.",
"The oldest dress in the world comes from Egypt. It is 5,000 years old.",
"Egyptians knew the existence of Mercury, Venus, Saturn, Mars, and Jupiter. They had names for them such as Sebequ,a god associated with Set , (Mercury), “god of the morning” (Venus), “bull of the sky” (Saturn), “Horus the red” or “Horus of the horizon” (Mars), and “Horus who limits the Two Lands” (Jupiter).",
"For the ancient Egyptians, the Nile was mysterious. Unlike most other rivers, it flows south to north, it floods in the summer, and no one knew where the water came from. Explorers discovered the source of the Nile in East Africa just 150 years ago.",
"The ancient Egyptians may have been the first people to keep cattle.",
"There were three female pharaohs, of whom the greatest was Hatshepsut (reigned 1498-1483 B.C.)",
"The giant sphinx guarding the three pyramids of Giza is thought to represent the pharaoh Khafre (Chephren), son of Khufu. Sphinxes are generally believed to have been built to guard tombs.",
"The known tombs of Egyptian kings were all raided by robbers with one exception, the tomb of Tutankhamen (reigned 1334-1324 B.C.). It was discovered in 1922 and was full of priceless materials and beautiful workmanship.",
"For the ancient Egyptians, the world began when Atum-Ra (the sun god)—who personifies life, goodness, light, and energy—created the Earth (Geb) and the Sky (Nut) and the rest of the world. For the Egyptians, creation was a daily occurrence, repeated with every rising and setting of the sun.",
"Ancient Egyptian women wore wigs topped with a cone of a greasy substance that gradually melted, giving off a pleasing scent of myrrh.",
"Ancient Egyptians kept such good flood records on the Nile that scientists today use their data to better understand rainfall patterns.",
"Ankh Engraving The loop of the ankh may symbolize the union of male and female principles",
"Scholars believe the Egyptian symbol called the ankh is the origin of the much later Christian cross. It also looks like a key—for ancient Egyptians, the key to eternal life.",
"Because hieroglyphs have no vowels, we will never know for sure how the ancients pronounced their words.",
"The Greeks called Egyptian symbols hieroglyphs (hieros + glyphe = “sacred” + “carving”) because they saw them carved into the walls of temples and other sacred places."
]